In [2]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
                   'key2' : ['one', 'two', 'one', 'two','one'],
                   'data1' : np.random.randn(5),
                   'data2' : np.random.randn(5)})

In [3]:
df

  key1 key2     data1     data2
0    a  one  0.401402 -0.274655
1    a  two -1.244430 -0.758899
2    b  one -1.617340  0.583498
3    b  two  0.925624  2.626767
4    a  one -0.624850 -0.073796

In [4]:
grouped = df['data1'].groupby(df['key1'])

In [5]:
grouped

In [6]:
grouped.mean()

key1
a   -0.489292
b   -0.345858
Name: data1, dtype: float64

In [7]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()

In [8]:
means

key1  key2
a     one    -0.111724
      two    -1.244430
b     one    -1.617340
      two     0.925624
Name: data1, dtype: float64

In [9]:
means.unstack()

key2       one       two
key1
a    -0.111724 -1.244430
b    -1.617340  0.925624

In [10]:
states = np.array(['Ohio', 'California', 'California',
'Ohio', 'Ohio'])

In [11]:
years = np.array([2005, 2005, 2006, 2005, 2006])

In [12]:
df['data1'].groupby([states, years]).mean()

California  2005   -1.244430
            2006   -1.617340
Ohio        2005    0.663513
            2006   -0.624850
Name: data1, dtype: float64

In [13]:
df['data1']

0    0.401402
1   -1.244430
2   -1.617340
3    0.925624
4   -0.624850
Name: data1, dtype: float64

In [14]:
df.groupby(['key1', 'key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [17]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one  0.401402 -0.274655
1    a  two -1.244430 -0.758899
4    a  one -0.624850 -0.073796
b
  key1 key2     data1     data2
2    b  one -1.617340  0.583498
3    b  two  0.925624  2.626767

In [18]:
for (k1, k2), group in df.groupby(['key1', 'key2']):
    print((k1, k2))
    print(group)

('a', 'one')
  key1 key2     data1     data2
0    a  one  0.401402 -0.274655
4    a  one -0.624850 -0.073796
('a', 'two')
  key1 key2    data1     data2
1    a  two -1.24443 -0.758899
('b', 'one')
  key1 key2    data1     data2
2    b  one -1.61734  0.583498
('b', 'two')
  key1 key2     data1     data2
3    b  two  0.925624  2.626767

In [19]:
pieces = dict(list(df.groupby('key1')))

In [20]:
pieces['b']

  key1 key2     data1     data2
2    b  one -1.617340  0.583498
3    b  two  0.925624  2.626767

In [21]:
df.dtypes

key1      object
key2      object
data1    float64
data2    float64
dtype: object

In [22]:
grouped = df.groupby(df.dtypes, axis=1)

In [23]:
grouped

In [24]:
for dtype, group in grouped:
    print(dtype)
    print(group)

float64
      data1     data2
0  0.401402 -0.274655
1 -1.244430 -0.758899
2 -1.617340  0.583498
3  0.925624  2.626767
4 -0.624850 -0.073796
object
  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

In [25]:
df.groupby('key1')['data1']

In [26]:
df.groupby('key1')[['data2']]

In [27]:
df.groupby(['key1', 'key2'])[['data2']].mean()

              data2
key1 key2
a    one  -0.174226
     two  -0.758899
b    one   0.583498
     two   2.626767

In [28]:
s_grouped = df.groupby(['key1', 'key2'])['data2']
s_grouped

In [29]:
s_grouped.mean()

key1  key2
a     one    -0.174226
      two    -0.758899
b     one     0.583498
      two     2.626767
Name: data2, dtype: float64

In [30]:
people = pd.DataFrame(np.random.randn(5, 5),
                    columns=['a', 'b', 'c', 'd', 'e'],
                    index=['Joe', 'Steve', 'Wes', 'Jim',
'Travis'])

In [31]:
people.iloc[2:3, [1, 2]] = np.nan

In [32]:
people

               a         b         c         d         e
Joe     1.019285 -0.914492 -1.665480  1.231707 -1.445507
Steve  -0.246039 -0.269493  0.626357 -0.500264 -0.484347
Wes    -0.571084       NaN       NaN -0.456255 -0.368397
Jim     0.943303 -0.107036 -0.408864 -0.555819 -0.341531
Travis  1.145357  1.271986 -0.216205  0.678021 -0.493880

In [33]:
mapping = {'a': 'red', 'b': 'red', 'c': 'blue',
           'd': 'blue', 'e': 'red', 'f' : 'orange'}

In [34]:
by_column = people.groupby(mapping, axis=1)

In [35]:
by_column.sum()

            blue       red
Joe    -0.433773 -1.340714
Steve   0.126093 -0.999880
Wes    -0.456255 -0.939480
Jim    -0.964683  0.494737
Travis  0.461815  1.923463

In [36]:
people.groupby(len).sum()

          a         b         c         d         e
3  1.391504 -1.021527 -2.074344  0.219633 -2.155434
5 -0.246039 -0.269493  0.626357 -0.500264 -0.484347
6  1.145357  1.271986 -0.216205  0.678021 -0.493880

In [37]:
columns = pd.MultiIndex.from_arrays([['US', 'US', 'US',
'JP', 'JP'],[1, 3, 5, 1, 3]],
                            names=['cty', 'tenor'])

In [38]:
hier_df = pd.DataFrame(np.random.randn(4, 5),
columns=columns)

In [39]:
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0     -1.875960  0.893554  3.591665 -0.266798  0.409409
1      1.117067  0.305820  0.308405  1.720449  0.012211
2      1.248684 -1.123057 -0.775792  0.148399 -0.177854
3      0.383903 -0.594552  1.262385 -0.347095  1.071685

In [40]:
hier_df.groupby(level='cty', axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

In [41]:
df

  key1 key2     data1     data2
0    a  one  0.401402 -0.274655
1    a  two -1.244430 -0.758899
2    b  one -1.617340  0.583498
3    b  two  0.925624  2.626767
4    a  one -0.624850 -0.073796

In [42]:
grouped = df.groupby('key1')
grouped['data1'].quantile(0.9)

key1
a    0.196152
b    0.671327
Name: data1, dtype: float64

In [43]:
def peak_to_peak(arr):
    return arr.max() - arr.min()
grouped.agg(peak_to_peak)

         data1     data2
key1
a     1.645833  0.685103
b     2.542963  2.043269

In [44]:
grouped.describe()

     data1                                                             \
     count      mean       std      min       25%       50%       75%
key1
a      3.0 -0.489292  0.831248 -1.24443 -0.934640 -0.624850 -0.111724
b      2.0 -0.345858  1.798147 -1.61734 -0.981599 -0.345858  0.289883

               data2                                                    \
           max count      mean       std       min       25%       50%
key1
a     0.401402   3.0 -0.369117  0.352184 -0.758899 -0.516777 -0.274655
b     0.925624   2.0  1.605132  1.444809  0.583498  1.094315  1.605132


           75%       max
key1
a    -0.174226 -0.073796
b     2.115950  2.626767

In [47]:
tips = pd.read_csv('.././examples/tips.csv')

FileNotFoundError: [Errno 2] File b'.././examples/tips.csv' does not exist: b'.././examples/tips.csv'

In [48]:
frame = pd.DataFrame({'data1': np.random.randn(1000),
                   'data2': np.random.randn(1000)})

In [49]:
quartiles = pd.cut(frame.data1, 4)

In [50]:
quartiles[:10]

0    (-1.614, -0.126]
1    (-1.614, -0.126]
2     (-0.126, 1.361]
3    (-1.614, -0.126]
4     (-0.126, 1.361]
5     (-0.126, 1.361]
6     (-0.126, 1.361]
7    (-3.107, -1.614]
8     (-0.126, 1.361]
9    (-1.614, -0.126]
Name: data1, dtype: category
Categories (4, interval[float64]): [(-3.107, -1.614] < (-1.614, -0.126] < (-0.126, 1.361] < (1.361, 2.849]]

In [51]:
def get_stats(group):
    return {'min': group.min(), 'max': group.max(),
            'count': group.count(), 'mean': group.mean()}

In [52]:
grouped = frame.data2.groupby(quartiles)

In [53]:
grouped.apply(get_stats).unstack()

                  count       max      mean       min
data1
(-3.107, -1.614]   50.0  2.160284 -0.072676 -2.317082
(-1.614, -0.126]  380.0  2.919355  0.010604 -3.273565
(-0.126, 1.361]   476.0  2.802028  0.004573 -3.932621
(1.361, 2.849]     94.0  2.316468 -0.057263 -3.449463

In [54]:
grouping = pd.qcut(frame.data1, 10, labels=False)
grouping

0      2
1      4
2      5
3      3
4      7
5      7
6      6
7      0
8      8
9      3
10     4
11     9
12     7
13     9
14     3
15     8
16     1
17     5
18     2
19     6
20     2
21     8
22     1
23     1
24     7
25     7
26     6
27     0
28     2
29     8
      ..
970    8
971    2
972    2
973    6
974    1
975    9
976    3
977    9
978    4
979    5
980    3
981    2
982    5
983    6
984    5
985    0
986    1
987    3
988    0
989    2
990    3
991    3
992    9
993    6
994    0
995    2
996    5
997    4
998    0
999    0
Name: data1, Length: 1000, dtype: int64

In [55]:
grouped = frame.data2.groupby(grouping)

In [56]:
grouped.apply(get_stats).unstack()

       count       max      mean       min
data1
0      100.0  2.271864 -0.120342 -2.317082
1      100.0  2.785156  0.100644 -2.129092
2      100.0  2.919355  0.110973 -2.400928
3      100.0  2.582995 -0.089295 -3.273565
4      100.0  2.802028 -0.020448 -3.226965
5      100.0  2.541032  0.061560 -3.932621
6      100.0  2.054878 -0.037509 -2.303340
7      100.0  2.645836  0.048159 -2.651994
8      100.0  2.733390 -0.010831 -2.013583
9      100.0  2.316468 -0.071015 -3.449463

In [57]:
s = pd.Series(np.random.randn(6))
s[::2] = np.nan

In [58]:
s

0         NaN
1   -0.691558
2         NaN
3   -1.173921
4         NaN
5   -0.944705
dtype: float64

In [59]:
s.fillna(s.mean())

0   -0.936728
1   -0.691558
2   -0.936728
3   -1.173921
4   -0.936728
5   -0.944705
dtype: float64

In [60]:
states = ['Ohio', 'New York', 'Vermont', 'Florida',
       'Oregon', 'Nevada', 'California', 'Idaho']

In [61]:
group_key = ['East'] * 4 + ['West'] * 4

In [62]:
data = pd.Series(np.random.randn(8), index=states)

In [63]:
data

Ohio         -0.329871
New York     -0.802851
Vermont      -0.237403
Florida      -0.840281
Oregon        1.250472
Nevada        0.074744
California    0.526361
Idaho         2.708786
dtype: float64

In [64]:
data[['Vermont', 'Nevada', 'Idaho']] = np.nan
data

Ohio         -0.329871
New York     -0.802851
Vermont            NaN
Florida      -0.840281
Oregon        1.250472
Nevada             NaN
California    0.526361
Idaho              NaN
dtype: float64

In [65]:
data.groupby(group_key).mean()

East   -0.657668
West    0.888417
dtype: float64